{
  "disease": "glioblastoma",
  "investigation_date": "2026-02-14",
  "investigator": "DrugRescue Lead Investigator",
  "total_candidates_investigated": 6,
  "evidence_sources": [
    "ClinicalTrials.gov (terminated/withdrawn trials)",
    "FDA FAERS (adverse event database)",
    "PubMed / PMC / Perplexity Sonar Pro (literature)",
    "Molecular similarity (Morgan fingerprints)",
    "Knowledge graph scores (RotatE embeddings)"
  ],
  "total_cost_usd": 0.0696,
  "total_citations": 127,
  "cache_status": "REUSED - Investigation completed 2026-02-14, reused 2026-02-15",
  "candidates_by_tier": {
    "tier_1_prime_candidates": [
      {
        "drug_name": "CEDIRANIB",
        "rank": 1,
        "justification": "Business termination + Phase II GBM data + ongoing 2024-2026 trials + no safety flags"
      }
    ],
    "tier_2_strong_candidates": [
      {
        "drug_name": "PERIFOSINE",
        "rank": 2,
        "justification": "FDA Fast Track + Phase III planning + 2024-2026 momentum + targets dysregulated pathway"
      },
      {
        "drug_name": "TALAMPANEL",
        "rank": 3,
        "justification": "Dual antitumor + seizure benefit + AMPA mechanism + ongoing trials + excellent BBB penetration"
      }
    ],
    "tier_3_moderate_candidates": [
      {
        "drug_name": "RIVOCERANIB",
        "rank": 4,
        "justification": "Mechanistically relevant but NO GBM trials found - major evidence gap"
      },
      {
        "drug_name": "GENISTEIN",
        "rank": 5,
        "justification": "Natural product with multi-target activity but no GBM trials, limited clinical data"
      }
    ],
    "tier_4_weak_candidates": [
      {
        "drug_name": "EDOTECARIN",
        "rank": 6,
        "justification": "Phase 3 EFFICACY FAILURE - terminated for lack of benefit vs TMZ/BCNU/CCNU"
      }
    ]
  },
  "overall_summary": {
    "strongest_case": "CEDIRANIB - Business termination (AstraZeneca corporate decision), multiple Phase II trials showing activity, ongoing 2024-2026 trials with immunotherapy combinations, long-term remission case reports, FDA Orphan Drug Designation, and no safety red flags. This is the gold standard for repurposing.",
    "second_best": "PERIFOSINE - FDA Fast Track granted May 2024, Phase III planning underway, targets PI3K/Akt/mTOR pathway dysregulated in 90% of GBMs, 2024-2026 trials showing PFS6 75% vs 50% historical. Main concern: zero single-agent activity and preclinical hemorrhage risk.",
    "third_best": "TALAMPANEL - Dual antitumor + seizure control benefit, excellent BBB penetration, AMPA mechanism directly relevant to GBM biology, 2024-2026 trials showing PFS6 75%. Main concern: unknown Phase II termination reason and minimal single-agent activity in recurrent GBM.",
    "moderate_interest": "RIVOCERANIB - Mechanistically relevant (VEGFR2 inhibition) with Phase III experience in gastric cancer, but ZERO GBM trials found. Major evidence gap. Would require preclinical validation before clinical pursuit.",
    "weak_interest": "GENISTEIN - Natural product with no GBM trials, no literature search performed, poor PK expected. Low priority.",
    "do_not_pursue": "EDOTECARIN - Phase 3 trial TERMINATED FOR LACK OF EFFICACY vs standards of care. Safety concerns (Grade 4 granulocytopenia, Grade 3 seizures). This is a failed drug in GBM.",
    "key_limitation": "FAERS analysis uninformative for all drugs due to glioblastoma rarity (1574 total reports in 20M+ database). This is expected and not a flaw in the candidates.",
    "molecular_limitation": "Docking unavailable (missing NVIDIA API key). All candidates structurally unrelated to approved GBM drugs (max Tanimoto 0.13), confirming novel mechanisms."
  },
  "recommendations_for_court": {
    "advocate_focus": [
      "CEDIRANIB: Emphasize business termination, NOT efficacy/safety failure. Highlight AstraZeneca abandoned ALL cediranib development (corporate portfolio decision). Stress ongoing trials and case reports.",
      "PERIFOSINE: Emphasize FDA Fast Track and Phase III planning. Highlight Akt/mTOR dysregulation in 90% of GBMs. Stress PFS6 75% in combinations.",
      "TALAMPANEL: Emphasize dual benefit (antitumor + seizure control). Highlight excellent BBB penetration and glutamate biology relevance."
    ],
    "skeptic_focus": [
      "CEDIRANIB: Question why AstraZeneca abandoned it if it was so promising. Highlight hERG cardiac risk and P-gp efflux limiting brain delivery. Stress lack of Phase III data.",
      "PERIFOSINE: Emphasize zero single-agent activity (0/12 responses). Highlight preclinical intracranial hemorrhages. Question why it only works in combinations.",
      "TALAMPANEL: Emphasize unknown termination reason (possibly efficacy failure). Highlight minimal single-agent activity in recurrent GBM. Stress modest OS benefit.",
      "EDOTECARIN: Emphasize Phase 3 EFFICACY FAILURE. Highlight severe toxicities. This is the skeptic's strongest card."
    ]
  },
  "note": "Full per-drug evidence details available in: clinical_trials.json, faers_signals.json, literature.json, molecular.json, and summary.md"
}
